package org.example._2024_02_28;

public class Text {
    //Кофемашина:
    //1. Создать перечисление Coffee с разными вариантами кофе
    //- Cappuccino
    //- Latte
    //- Americano
    //- Espresso
    //- Macchiato
    //У каждого сорта кофе есть цена и описание.
    //2. В классе CoffeeMachine реализовать метод displayInfo(Coffee coffee), который выводил бы информацию о выбранном кофе.
    //3. Реализовать метод makeCoffee(Coffee coffee, int money), который проверял бы, достаточно ли средств,
    //готовил бы кофе и выдавал сдачу. Если выбрано капучино, автомат сообщает, что данного вида кофе нет.
}
